{"format": "graph-model", "generatedBy": "2.21.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"input_layer_1": {"name": "input_layer_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "150"}, {"size": "150"}, {"size": "3"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "6"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_1_1/rescaling_1/Cast/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/rescaling_1/Cast_1/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv1_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv1_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/bn1_1/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/bn1_1/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv1b_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv1b_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/bn1b_1/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/bn1b_1/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv2_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv2_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/bn2_1/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/bn2_1/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv2b_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv2b_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/bn2b_1/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/bn2b_1/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv3_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv3_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/bn3_1/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/bn3_1/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv3b_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv3b_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/bn3b_1/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/bn3b_1/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv4_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv4_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/bn4_1/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/bn4_1/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv4b_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv4b_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/bn4b_1/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/bn4b_1/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/global_avg_pool_1/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense1_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense1_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/bn_dense_1/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/bn_dense_1/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/output_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "6"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/output_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}}}, {"name": "input_layer_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "150"}, {"size": "150"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/rescaling_1/mul", "op": "Mul", "input": ["input_layer_1", "StatefulPartitionedCall/sequential_1_1/rescaling_1/Cast/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/rescaling_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1_1/rescaling_1/mul", "StatefulPartitionedCall/sequential_1_1/rescaling_1/Cast_1/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv1_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1_1/rescaling_1/add", "StatefulPartitionedCall/sequential_1_1/conv1_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/conv1_1/Squeeze"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "filter_format": {"s": "SFdJTw=="}, "leakyrelu_alpha": {"f": 0.2}, "use_cudnn_on_gpu": {"b": true}, "num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "-5"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/bn1_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1_1/conv1_1/BiasAdd", "StatefulPartitionedCall/sequential_1_1/bn1_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/bn1_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1_1/bn1_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_1_1/bn1_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/relu1_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_1_1/bn1_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv1b_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1_1/relu1_1/Relu", "StatefulPartitionedCall/sequential_1_1/conv1b_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/conv1b_1/Squeeze"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "filter_format": {"s": "SFdJTw=="}, "leakyrelu_alpha": {"f": 0.2}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}]}}, "num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/bn1b_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1_1/conv1b_1/BiasAdd", "StatefulPartitionedCall/sequential_1_1/bn1b_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/bn1b_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1_1/bn1b_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_1_1/bn1b_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/pool1_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1_1/bn1b_1/batchnorm/add_1"], "attr": {"explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/relu1b_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_1_1/pool1_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv2_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1_1/relu1b_1/Relu", "StatefulPartitionedCall/sequential_1_1/conv2_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/conv2_1/Squeeze"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "filter_format": {"s": "SFdJTw=="}, "leakyrelu_alpha": {"f": 0.2}, "use_cudnn_on_gpu": {"b": true}, "num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-6"}, {"size": "-7"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/bn2_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1_1/conv2_1/BiasAdd", "StatefulPartitionedCall/sequential_1_1/bn2_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/bn2_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1_1/bn2_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_1_1/bn2_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/relu2_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_1_1/bn2_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv2b_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1_1/relu2_1/Relu", "StatefulPartitionedCall/sequential_1_1/conv2b_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/conv2b_1/Squeeze"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "filter_format": {"s": "SFdJTw=="}, "leakyrelu_alpha": {"f": 0.2}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-6"}, {"size": "-7"}, {"size": "64"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}]}}, "num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/bn2b_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1_1/conv2b_1/BiasAdd", "StatefulPartitionedCall/sequential_1_1/bn2b_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/bn2b_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1_1/bn2b_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_1_1/bn2b_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/pool2_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1_1/bn2b_1/batchnorm/add_1"], "attr": {"explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/relu2b_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_1_1/pool2_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv3_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1_1/relu2b_1/Relu", "StatefulPartitionedCall/sequential_1_1/conv3_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/conv3_1/Squeeze"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "filter_format": {"s": "SFdJTw=="}, "leakyrelu_alpha": {"f": 0.2}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-8"}, {"size": "-9"}, {"size": "64"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}]}}, "num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/bn3_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1_1/conv3_1/BiasAdd", "StatefulPartitionedCall/sequential_1_1/bn3_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/bn3_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1_1/bn3_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_1_1/bn3_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/relu3_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_1_1/bn3_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv3b_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1_1/relu3_1/Relu", "StatefulPartitionedCall/sequential_1_1/conv3b_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/conv3b_1/Squeeze"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "filter_format": {"s": "SFdJTw=="}, "leakyrelu_alpha": {"f": 0.2}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-8"}, {"size": "-9"}, {"size": "128"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}]}}, "num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/bn3b_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1_1/conv3b_1/BiasAdd", "StatefulPartitionedCall/sequential_1_1/bn3b_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/bn3b_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1_1/bn3b_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_1_1/bn3b_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/pool3_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1_1/bn3b_1/batchnorm/add_1"], "attr": {"explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/relu3b_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_1_1/pool3_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv4_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1_1/relu3b_1/Relu", "StatefulPartitionedCall/sequential_1_1/conv4_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/conv4_1/Squeeze"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "filter_format": {"s": "SFdJTw=="}, "leakyrelu_alpha": {"f": 0.2}, "use_cudnn_on_gpu": {"b": true}, "num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-10"}, {"size": "-11"}, {"size": "128"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/bn4_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1_1/conv4_1/BiasAdd", "StatefulPartitionedCall/sequential_1_1/bn4_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/bn4_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1_1/bn4_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_1_1/bn4_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/relu4_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_1_1/bn4_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv4b_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1_1/relu4_1/Relu", "StatefulPartitionedCall/sequential_1_1/conv4b_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/conv4b_1/Squeeze"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "filter_format": {"s": "SFdJTw=="}, "leakyrelu_alpha": {"f": 0.2}, "use_cudnn_on_gpu": {"b": true}, "num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-10"}, {"size": "-11"}, {"size": "256"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/bn4b_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1_1/conv4b_1/BiasAdd", "StatefulPartitionedCall/sequential_1_1/bn4b_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/bn4b_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1_1/bn4b_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_1_1/bn4b_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/pool4_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1_1/bn4b_1/batchnorm/add_1"], "attr": {"explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/relu4b_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_1_1/pool4_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/global_avg_pool_1/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/sequential_1_1/relu4b_1/Relu", "StatefulPartitionedCall/sequential_1_1/global_avg_pool_1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense1_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1_1/global_avg_pool_1/Mean", "StatefulPartitionedCall/sequential_1_1/dense1_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/dense1_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "256"}]}, {"dim": [{"size": "256"}, {"size": "512"}]}]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1_1/bn_dense_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1_1/dense1_1/BiasAdd", "StatefulPartitionedCall/sequential_1_1/bn_dense_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/bn_dense_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1_1/bn_dense_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_1_1/bn_dense_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/relu_dense_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_1_1/bn_dense_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/output_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1_1/relu_dense_1/Relu", "StatefulPartitionedCall/sequential_1_1/output_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/output_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "512"}]}, {"dim": [{"size": "512"}, {"size": "6"}]}]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1_1/output_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_1_1/output_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1_1/output_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 2474}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_1_1/rescaling_1/Cast/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/rescaling_1/Cast_1/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/conv1_1/convolution/ReadVariableOp", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/conv1_1/Squeeze", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/bn1_1/batchnorm/mul", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/bn1_1/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/conv1b_1/convolution/ReadVariableOp", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/conv1b_1/Squeeze", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/bn1b_1/batchnorm/mul", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/bn1b_1/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/conv2_1/convolution/ReadVariableOp", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/conv2_1/Squeeze", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/bn2_1/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/bn2_1/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/conv2b_1/convolution/ReadVariableOp", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/conv2b_1/Squeeze", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/bn2b_1/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/bn2b_1/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/conv3_1/convolution/ReadVariableOp", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/conv3_1/Squeeze", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/bn3_1/batchnorm/mul", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/bn3_1/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/conv3b_1/convolution/ReadVariableOp", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/conv3b_1/Squeeze", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/bn3b_1/batchnorm/mul", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/bn3b_1/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/conv4_1/convolution/ReadVariableOp", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/conv4_1/Squeeze", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/bn4_1/batchnorm/mul", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/bn4_1/batchnorm/sub", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/conv4b_1/convolution/ReadVariableOp", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/conv4b_1/Squeeze", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/bn4b_1/batchnorm/mul", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/bn4b_1/batchnorm/sub", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/global_avg_pool_1/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense1_1/Cast/ReadVariableOp", "shape": [256, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense1_1/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/bn_dense_1/batchnorm/mul", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/bn_dense_1/batchnorm/sub", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/output_1/Cast/ReadVariableOp", "shape": [512, 6], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/output_1/BiasAdd/ReadVariableOp", "shape": [6], "dtype": "float32"}]}]}